Show / Hide Table of Contents
Class CheckResWeld
Check value for Weld
Inheritance
System.Object
CheckResWeld
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[Serializable]
[DataContract]
public class CheckResWeld
Properties
Improve this Doc   View Source
CheckStatus
Status of the Check
Declaration
[DataMember]
public bool CheckStatus { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Id
Unique id of weld
Declaration
[DataMember]
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Items
In case of presentation of groups plates (uncoiled beams)
Declaration
[DataMember]
public List<int> Items { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.Int32>
Improve this Doc   View Source
LoadCaseId
Id of Load Case
Declaration
[DataMember]
public int LoadCaseId { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Name
Name of Weld
Declaration
[DataMember]
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
UnityCheck
Unity Check Stress
Declaration
[DataMember]
public double UnityCheck { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source